In [ ]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv("../datasets/insurance.csv")

In [ ]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [ ]:
# Function use to get stats about the
df.describe()

               age          bmi     children       charges
count  1336.000000  1337.000000  1338.000000   1337.000000
mean     39.234281    30.658620     1.094918  13244.317381
std      14.042783     6.097964     1.205493  12076.821411
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.290000     0.000000   4738.268200
50%      39.000000    30.400000     1.000000   9377.904700
75%      51.000000    34.675000     2.000000  16586.497710
max      64.000000    53.130000     5.000000  63770.428010

In [10]:
df.shape

(1338, 7)

In [7]:
df.isnull().sum()

age         2
sex         0
bmi         1
children    0
smoker      2
region      0
charges     1
dtype: int64

In [ ]:
# from sklearn.impute import SimpleImputer
# imputer = SimpleImputer()

# imputer.run(df)

# Dropping categorical data rows with missing values
df.dropna(how='any', subset=['smoker'], inplace=True)

AttributeError: 'SimpleImputer' object has no attribute 'run'